test/graphs/graph_test/single_node_with_supplier_depth_10.dot
digraph unix {
    graph [nodesep = 0.25; ranksep=1];
    fontname="Helvetica,Arial,sans-serif"
    node [fontname="Helvetica,Arial,sans-serif"]
    edge [fontname="Helvetica,Arial,sans-serif"]
    subgraph cluster_level3_2 {
        label = "level3";
        subgraph cluster_level2_3 {
            label = "level2";
            subgraph cluster_level1_4 {
                label = "level1";
                subgraph cluster_level0_5 {
                    label = "level0";
                    style = filled;
                    fillcolor = "#DDDDDD";
                    x_7 [
                    label="x"
                    style = filled;
                    fillcolor = "#EEEEEE";
                    ];
                    
                }
                s1_5 [
                label="s1"
                ];
                s0_6 [
                label="s0"
                ];
                
            }
            s11_1 [
            label="s11"
            ];
            s10_2 [
            label="s10"
            ];
            s01_3 [
            label="s01"
            ];
            s00_4 [
            label="s00"
            ];
            
        }
        s111_0 [
        label="s111"
        ];
        
    }
    "s111_0" -> "s11_1";
    "s11_1" -> "s1_5";
    "s10_2" -> "s1_5";
    "s01_3" -> "s0_6";
    "s00_4" -> "s0_6";
    "s1_5" -> "x_7";
    "s0_6" -> "x_7";
}
